[{"title": "Pfizer and BioNTech Receive U.S. FDA Emergency Use Authorization for Omicron BA.4/BA.5-Adapted Bivalent COVID-19 Vaccine in Children Under 5 Years"}, {"title": "Pfizer, BioNTech strike back at Moderna with mRNA vaccine patent lawsuit"}, {"title": "Pfizer Declares First-Quarter 2023 Dividend"}, {"title": "Pfizer and Clear Creek Bio to Collaborate on a Research Program Targeting SARS-CoV-2 Papain-Like Protease"}, {"title": "Pfizer's rapid-fire expansion continues with $750M investment in Michigan"}, {"title": "Pfizer and BioNTech Report New Data on Omicron BA.4/BA.5-Adapted Bivalent Booster Demonstrating Improved Immune Response Against Emerging Omicron Sublineages"}, {"title": "Pfizer and BioNTech Advance Next-Generation COVID-19 Vaccine Strategy with Study Start of Candidate Aimed at Enhancing Breadth of T cell Responses and Duration of Protection"}, {"title": "Pfizer CEO says Covid vaccine will remain 'free for all Americans,' overlooking indirect costs"}, {"title": "Why Compliance Matters and Why Patients Should Care"}, {"title": "Endpoints honors 20 women leaders; Vertex teams up with neighbor; Pfizer rival impresses; and more"}, {"title": "Covid Rebound with Pfizer's Paxlovid Less Than Expected"}, {"title": "Pfizer boss refuses to testify to EU Parliament COVID panel — again"}, {"title": "Pfizer to invest more than $2.5 billion to expand European manufacturing"}, {"title": "Is Pfizer Inc. (PFE) Stock About to Get Hot Friday?"}, {"title": "Pfizer: COVID-19 Will Never End (NYSE:PFE)"}, {"title": "Pfizer's Paxlovid access questioned ahead of WTO patent talks"}, {"title": "Meet the man who delivered Pfizer's Covid vaccine"}, {"title": "Around the nation: FDA to fast-track Pfizer's RSV vaccine candidate"}, {"title": "The scientist behind Pfizer's Covid vaccine says a flu pandemic is only a matter of time"}, {"title": "Other Barks & Bites for Friday, December 9: United States Supports Delaying Decision on TRIPS IP Waiver Extension; Pfizer Countersues Moderna over Vaccines; Ericsson and Apple Settle"}, {"title": "Pfizer-BioNTech Adapted Bivalent Booster Neutralizes Emerging Omicron Subvariants"}, {"title": "Why Pfizer Stock Is a Surefire Winner in 2023"}, {"title": "Relief To Pfizer, Sanofi As US Dismisses Several Lawsuits Associated With Zantac"}, {"title": "January 2023 Options Now Available For Pfizer (PFE)"}, {"title": "Walgreens now offering delivery of Pfizer's Paxlovid antiviral drug"}, {"title": "Health Canada Authorizes Pfizer-BioNTech Covid-19 Bivalent Booster for Kids 5 to 11 Years Old"}, {"title": "Huons takes over production of Isuprel from Pfizer"}, {"title": "Pfizer airs 2nd Cibinqo ad, this time with more color but still lacking in flair"}, {"title": "Pfizer COVID-19 vaccine for children aged 6 months to 4 years – Information for parents and guardians"}, {"title": "Generalized fixed drug eruption following Pfizer‐BioNtech COVID‐19 vaccination"}, {"title": "With clear PhII win in IBD, Prometheus thwarts Pfizer comparisons as it follows Humira 'playbook'"}, {"title": "Immutep in second collaborative oncology trial with Merck and Pfizer"}, {"title": "Pfizer: Scaling Innovation to Reach New Heights of Profitability"}, {"title": "European regulator recommends Pfizer's Omicron booster for children"}, {"title": "2 Reasons to Buy Pfizer and 1 Reason to Sell"}, {"title": "Pfizer's $1B protein degradation bet yields 3% response rate in Arvinas' midphase breast cancer trial"}, {"title": "Biden forges new $475M campaign to drive uptake of Pfizer and Moderna's bivalent Covid vaccines"}, {"title": "Moderna Stock Surges On New Omicron Data, Pulling Pfizer, BioNTech Higher | Investor's Business Daily"}, {"title": "Just a quarter of Pfizer's COVID-19 treatment orders will go to developing countries - World"}, {"title": "California coronavirus updates: Pfizer asks FDA to clear new bivalent shot for children under 5"}, {"title": "COVID vaccines: “We flew the aeroplane while we were still building it”"}, {"title": "ATAGI recommendations on use of the Pfizer bivalent (Original/Omicron BA.1) COVID-19 vaccine"}, {"title": "Pfizer's CEO rapped by regulator for making 'misleading' statements about children's vaccines"}, {"title": "Pfizer and BioNTech Granted FDA Emergency Use Authorization of Omicron BA.4/BA.5-Adapted Bivalent COVID-19 Vaccine Booster for Ages 12 Years and Older"}, {"title": "Pfizer and BioNTech Submit Application to U.S. FDA for Emergency Use Authorization of Omicron BA.4/BA.5-Adapted Bivalent COVID-19 Vaccine"}, {"title": "Pfizer and BioNTech Announce Updated Clinical Data for Omicron BA.4/BA.5-Adapted Bivalent Booster Demonstrating Substantially Higher Immune Response in Adults Compared to the Original COVID-19 Vaccine"}, {"title": "Pfizer and BioNTech Announce Omicron-Adapted COVID-19 Vaccine Candidates Demonstrate High Immune Response Against Omicron"}, {"title": "Pfizer and BioNTech Initiate Phase 1 Study of Single Dose mRNA-Based Combination Vaccine Candidate for Influenza and COVID-19"}, {"title": "Pfizer and BioNTech Announce New Agreement with U.S. Government to Provide Additional Doses of COVID-19 Vaccine"}, {"title": "Pfizer Needs to Prove That It's Ready to Move On From Covid-19 (1)"}, {"title": "Pfizer to Invest $120 Million to Produce COVID-19 Oral Treatment in the U.S."}, {"title": "Pfizer says omicron shots substantially boosted antibodies against BA.5 subvariant in early human data"}, {"title": "Pfizer weighing price range of $110 to $130 for its COVID shot"}, {"title": "An Accord for a Healthier World"}, {"title": "Pfizer and BioNTech Receive Positive CHMP Opinion for Omicron BA.4/BA.5-Adapted Bivalent COVID-19 Vaccine Booster for Children 5 Through 11 Years of Age in European Union"}, {"title": "How Pfizer Won the Pandemic, Reaping Outsize Profit and Influence"}, {"title": "Pfizer’s Covid Cash Powers a ‘Marketing Machine’ on the Hunt for New Supernovas"}, {"title": "Pfizer-BioNTech COVID-19 Vaccine Demonstrates Strong Immune Response, High Efficacy and Favorable Safety in Children 6 Months to Under 5 Years of Age Following Third Dose"}, {"title": "Pfizer asks FDA to authorize omicron Covid booster shots for kids ages 5 to 11"}, {"title": "Statement from Pfizer Chairman and CEO Albert Bourla on Testing Positive for COVID-19"}, {"title": "Pfizer-BioNTech COVID-19 Vaccine Receives FDA Emergency Use Authorization for Children 6 Months through 4 Years of Age"}, {"title": "Pfizer Reports Additional Data on PAXLOVID™ Supporting Upcoming New Drug Application Submission to U.S. FDA"}, {"title": "Pfizer and BioNTech Announce U.S. FDA Approval of their COVID-19 Vaccine COMIRNATY® For Adolescents 12 through 15 Years of Age"}, {"title": "Pfizer and BioNTech Receive Positive CHMP Opinion for Omicron BA.4/BA.5-Adapted Bivalent COVID-19 Vaccine Booster in European Union"}, {"title": "Pfizer and BioNTech Granted U.S. Emergency Use Authorization for Booster Dose of Their COVID-19 Vaccine in Children 5 Through 11 Years of Age"}, {"title": "Pfizer and BioNTech Submit for U.S. Emergency Use Authorization of an Additional Booster Dose of their COVID-19 Vaccine for Older Adults"}, {"title": "Pfizer Announces Submission of New Drug Application to the U.S. FDA for PAXLOVID™"}, {"title": "Pfizer Announces Positive Top-Line Data from Phase 3 Trial of Older Adults for its Bivalent Respiratory Syncytial Virus (RSV) Vaccine Candidate"}, {"title": "Pfizer gears up for 'pivotal' 2023, CEO says"}, {"title": "Pfizer and BioNTech Submit Application for U.S. Emergency Use Authorization for a COVID-19 Vaccine Booster Dose in Children 5 Through 11 Years of Age"}, {"title": "Moderna Sues Pfizer and BioNTech Over Covid Vaccine Technology"}, {"title": "Pfizer and BioNTech Receive Expanded U.S. Emergency Use Authorization for an Additional COVID-19 Vaccine Booster in Individuals Aged 50 Years and Older"}, {"title": "Pfizer Completes Acquisition of Biohaven Pharmaceuticals"}, {"title": "Pfizer and BioNTech Advance COVID-19 Vaccine Strategy With Study Start of Next-Generation Vaccine Candidate Based on Enhanced Spike Protein Design"}, {"title": "Pfizer isn't sharing Covid vaccines with researchers for next-gen studies"}, {"title": "Pfizer and BioNTech Provide Update on Rolling Submission to European Medicines Agency for a Potential Variant-Adapted Vaccine"}, {"title": "COVID-19: Prevention and Treatment Options"}, {"title": "Pfizer and BioNTech Receive Positive CHMP Opinion for Omicron BA.1-Adapted Bivalent COVID-19 Vaccine Booster in European Union"}, {"title": "Pfizer's vax sales hit $4.4B for 3Q, company ups 2022 projection"}, {"title": "Pfizer and BioNTech Complete Submission to European Medicines Agency for Omicron BA.1 Adapted Bivalent Vaccine Candidate"}, {"title": "Pfizer boosts 2022 COVID vaccine forecast, looks to pivot with deals, new drugs"}, {"title": "Pfizer and BioNTech Announce Data Demonstrating High Immune Response Following a Booster Dose of their COVID-19 Vaccine in Children 5 Through 11 Years of Age"}, {"title": "Pfizer to Acquire Global Blood Therapeutics for $5.4 Billion to Enhance Presence in Rare Hematology"}, {"title": "Pfizer Presents Scientific Advancements in Infectious Disease Prevention and Treatments at IDWeek 2022"}, {"title": "Alleged revelation about Pfizer vaccine trial is nothing new"}, {"title": "Pfizer and the U.S. have slimmed down a COVID shot donation deal"}, {"title": "CytoReason Announces Expanded Collaboration Deal with Pfizer to Deliver AI for Drug Discovery and Development"}, {"title": "Pfizer or Moderna: Which new omicron-specific Covid booster should you get?"}, {"title": "Pfizer to Supply Global Fund Up to 6 Million PAXLOVID™ Treatment Courses for Low-and-Middle-Income Countries"}, {"title": "Pfizer and BioNTech Initiate Rolling Submission for Emergency Use Authorization of Their COVID-19 Vaccine in Children 6 Months Through 4 Years of Age Following Request From U.S. FDA"}, {"title": "Pfizer Announces Positive Top-Line Results from Phase 3 Trial of Pentavalent Meningococcal Vaccine Candidate (MenABCWY) in Adolescents"}, {"title": "Pfizer and BioNTech Submit a Variation to EMA for the Vaccination of Children 6 Months to less than 5 Years with COMIRNATY®"}, {"title": "Pfizer Shares Top-Line Results from Phase 2/3 EPIC-PEP Study of PAXLOVID™ for Post-Exposure Prophylactic Use"}, {"title": "Pfizer and BioNTech Provide Update on Rolling Submission for Emergency Use Authorization of Their COVID-19 Vaccine in Children 6 Months Through 4 Years of Age"}, {"title": "Pfizer plans to sell its covid vaccine at a 10,000% markup in 2023"}, {"title": "Pfizer, BioNTech enlist Marvel's Avengers in COVID booster push"}, {"title": "Pfizer and BioNTech Receive Positive CHMP Opinion for COVID-19 Vaccine Booster in Adolescents 12 through 17 Years of Age in the European Union"}, {"title": "Pfizer Updates Company Position in Russia"}, {"title": "Pfizer and BioNTech Provide Update on COVID-19 Vaccine Supply Agreement with European Commission"}]